app/views/photos/_form.html.erb

        <!--プロフィール画像が登録されいるかどうか判断-->
        <% if !@photo.photo.model.photo.blank? %>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 2]]