app/views/photos/index.html.erb

          <div class = "contribution_name">
            <!-- <%#= profile_img(Photo.find(photo.id).user) %> -->
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = $1  [["user_id", 5]]