app/views/photos/show.html.erb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
---
  <div class = "contribution_name">
    <%= profile_img(Photo.find(@photo.id).user) %>