app/controllers/photos_controller.rb

  def index
    @photos = Photo.all
---
SELECT "photos"."id" FROM "photos"

  def create
    @photo = Photo.new(photo_params)

    @photo.user_id = current_user.id #user_idカラムにユーザーidを格納

      #photoテーブルの書き込み時の処理
      if @photo.save
---
INSERT INTO "photos" ("name", "content", "photo", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["content", ""], ["photo", "mails.png"], ["user_id", 5], ["created_at", "2017-04-07 15:59:54.627635"], ["updated_at", "2017-04-07 15:59:54.627635"]]

  def update
    respond_to do |format|
      if @photo.update(photo_params)
---
UPDATE "photos" SET "photo" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["photo", "header.jpg"], ["updated_at", "2017-04-05 06:09:15.766355"], ["id", 1]]

  def destroy
    @photo.destroy
---
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 1]]